package ru.job4j.generics.store;

/**
 * Интерфейс хранилища сущностей, наследующих Base.
 *
 * @param <T> Тип сущностей, производных от Base.
 */
public interface Store<T extends Base> {
	/**
	 * Добавление сущности в хранилище.
	 *
	 * @param model Объект, который необходимо добавить в хранилище.
	 */
	void add(T model);

	/**
	 * Замена существующей сущности другой.
	 *
	 * @param id Идентификатор сущности, которую необходимо заменить.
	 * @param model Сущность, которой необходимо заменить существующую в хранилище.
	 * @return true в случае успешной замены, false в случае неудачной замены.
	 */
	boolean replace(String id, T model);

	/**
	 * Удаление сущности по идентификатору.
	 *
	 * @param id Идентификатор сущности, которую необходимо удалить.
	 * @return true в случае успешного удаления, false в случае неудачного удаления.
	 */
	boolean delete(String id);

	/**
	 * Поиск сущности в хранилище по идентификатору.
	 *
	 * @param id Идентификатор сущности, которую необходимо найти.
	 * @return Искомую сущность.
	 */
	T findById(String id);
}
